## Pandas_필수 검사

1. 크기 확인 - 괄호 없음 .shape

2. head 어떻게 생겼지? 앞부분

3. tail 어떻게 생겼지? 뒷부분

4. info 타입은 맞나?

5. describe 통계 요약 , 이상치 찾을때 유용

In [2]:
import pandas as pd

In [5]:
# shape
# 행과 열의 개수(행개수, 열개수) 
# 괄호가 없음!

In [4]:
df=pd.read_csv("file:///workspace/data/sample.csv")
print(df.shape)

(5, 5)

In [6]:
# head() - 기본값 5줄
# tail() - 기본값 5줄

In [7]:
df.head()

   id     name  age  score     city
0   1    Alice   23     88    Seoul
1   2      Bob   30     92    Busan
2   3  Charlie   25     76  Incheon
3   4    David   28     85    Daegu
4   5      Eva   22     90    Seoul

In [29]:
df.tail(2)

   id   name  age  score   city
3   4  David   28     85  Daegu
4   5    Eva   22     90  Seoul

#### sample(n) 무작위n개 

- 데이터가 골고루 섞여있는지 확인할때

**Spark와의 차이점**

- Pandas :`sample(3)` 처럼 개수로 뽑는게 기본
- Spark : `sample(fraction=0.1)` 처럼 비율로 뽑는게 기본
     - 개수로 뽑으려면 takeSample써야 한다

In [30]:
df.sample(3)

   id   name  age  score   city
3   4  David   28     85  Daegu
1   2    Bob   30     92  Busan
0   1  Alice   23     88  Seoul

In [9]:
# info()
# 결측치 확인 > 전체 개수보다 적으면 결측치 있다는 것
# 데이터 타입 확인
# 컬럼 이름 
# 메모리 usage: 메모리를 얼마나 잡아먹는지 확인

In [10]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      5 non-null      int64
 1   name    5 non-null      str
 2   age     5 non-null      int64
 3   score   5 non-null      int64
 4   city    5 non-null      str
dtypes: int64(3), str(2)
memory usage: 332.0 bytes

In [11]:
# describe()
# 평균, 표준편차, 최소/최대값
# 이상치 찾을때 유용 , 수치형 데이터 분포 확인

In [13]:
# 숫자 컬럼만 
print(df.describe())

             id        age     score
count  5.000000   5.000000   5.00000
mean   3.000000  25.600000  86.20000
std    1.581139   3.361547   6.26099
min    1.000000  22.000000  76.00000
25%    2.000000  23.000000  85.00000
50%    3.000000  25.000000  88.00000
75%    4.000000  28.000000  90.00000
max    5.000000  30.000000  92.00000

In [16]:
# 모든 컬럼 (문자포함)
# print(df.describe(include="all"))

### 주의! spark 랑 문법이 다름 !

- **Spark:** `df.describe("Age")` (괄호 안에 이름 넣음)
- **Pandas:** `df[["Age"]].describe()` (먼저 선택하고 함수 씀)
- 판다스 `describe()` 괄호 안에 컬럼명을 넣으면 에러가 난다




| **기능**     | **Pandas**                        | **Spark**                                                      | **비고**                    |
| ---------- | ------------------------------------ | ----------------------------------------------------------------- | ------------------------- |
| **행/열 개수** | `df.shape`<br><br>(속성, 0.001초 컷)     | `(df.count(), len(df.columns))`<br><br>(`count`는 Action이라 오래 걸림!) | 스파크에선 `shape`가 없음.        |
| **눈으로 보기** | `df.head()`<br><br>(예쁜 HTML 표)       | `df.show()`<br><br>(ASCII 아트 텍스트)                                 | 스파크 `head()`는 리스트를 반환함.   |
| **구조 확인**  | `df.info()`  <br><br>(Null, 타입, 메모리) | `df.printSchema()`<br><br>(트리 구조로 타입만 보여줌)                        | 스파크는 Null 확인하려면 별도 쿼리 필요. |
| **통계 확인**  | `df.describe()`                      | `df.describe().show()`                                            | 사용법 거의 동일.                |

In [23]:
df[["age"]].describe()

             age
count   5.000000
mean   25.600000
std     3.361547
min    22.000000
25%    23.000000
50%    25.000000
75%    28.000000
max    30.000000

In [26]:
df[["age","score"]].describe().T

       count  mean       std   min   25%   50%   75%   max
age      5.0  25.6  3.361547  22.0  23.0  25.0  28.0  30.0
score    5.0  86.2  6.260990  76.0  85.0  88.0  90.0  92.0

In [21]:
# df.describe("age") # 에러 발생